import React from 'react';
import globalStyles from '../../utils/Helper/Style';
import GlobalText from '@components/GlobalText/GlobalText';
import { SafeAreaView, ScrollView } from 'react-native';

const ConsentAbove18 = () => {
  return (
    <ScrollView style={{ flex: 1, padding: 20, marginBottom: 20 }}>
      <GlobalText
        style={[globalStyles.subHeading, { fontWeight: 700, fontSize: 18 }]}
      >
        वयस्क- डेटा/फोटो/वीडियो/इंटरव्यू संग्रह सहमति पत्र
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        प्रथम एजुकेशन फाउंडेशन (प्रथम) भारत की एक गैर सरकारी संस्था है जो पिछले
        30 वर्षों से शिक्षा के क्षेत्र में कार्य कर रही है। इसका पंजीकृत
        कार्यालय मुंबई में है।
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        जैसा कि आप जानते हैं, आप प्रथम द्वारा संचालित गतिविधियों में भाग ले रहे
        हैं। इस संदर्भ में, प्रथम अपने स्वयंसेवकों/प्रतिनिधियों के माध्यम से
        आपके बारे में कुछ जानकारियाँ एकत्र करेगा, जैसे – आपका नाम,
        पिता/माता/अभिभावक का नाम, स्थान, मोबाइल नंबर, शैक्षणिक जानकारी, पढ़ने का
        स्तर, फोटो, वीडियो और आवाज की रिकॉर्डिंग शामिल हैं।
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        एकत्रित की गई जानकारियों का कुछ हिस्सा या पूरा हिस्सा निम्नलिखित
        उद्देश्यों के लिए इस्तेमाल किया जा सकता है:
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        1. प्रोग्राम को चलाने/संचालित करने, समुदाय के लोगों को जोड़ने और
        रिपोर्टिंग हेतु।
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        2. प्रथम के प्रकाशनों में, राष्ट्रीय और अंतर्राष्ट्रीय डोनरों को रिपोर्ट
        करने में, मीडिया, सोशल मीडिया (फेसबुक, ट्विटर, इंस्टाग्राम, लिंक्डइन,
        एक्स, थ्रेड्स, आदि) और डिजिटल प्लेटफॉर्म्स (प्रथम की वेबसाइट) एवं सीखने-
        सिखाने के बारे में जागरूकता फैलाने हेतु।
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        3. प्रथम के कार्य के बारे में जागरूकता (राष्ट्रीय, अंतर्राष्ट्रीय डोनर्स
        और अन्य पार्टनर्स के साथ) लाने हेतु।
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        आपसे अनुरोध है कि आप अपने से संबंधित उपर्युक्त जानकारियों को एकत्र करने,
        जमा करने और सीखने-सिखाने की सामग्री के रूप में इस्तेमाल करने की सहमति
        दें। हालांकि, इच्छा अनुसार, आप अपनी जानकारियाँ साझा करने से मना भी कर
        सकते हैं।
      </GlobalText>
      <GlobalText style={[globalStyles.text, { marginTop: 10 }]}>
        मैं, प्रथम और उसके स्वयंसेवकों और/या प्रतिनिधियों को बिना किसी दबाव के
        मुझसे संबंधित उपर्युक्त सामग्री का उपयोग, जमा, साझा तथा प्रकाशित करने के
        लिए सहमति देती/देता हूँ। यदि मैं किसी भी समय यह निर्णय लेती/लेता हूँ कि
        इस जानकारी को प्रथम की स्टोरेज प्लेटफॉर्म से हटाया, अपडेट या संशोधित
        किया जाना चाहिए, तो मैं प्रथम के स्वयंसेवक/प्रतिनिधि को फोन/ईमेल के
        माध्यम से सूचित करूंगी/करूंगा, जिसके बाद लिखित रूप में सहमति की
        वापसी/अपडेट के लिए अनुरोध करूंगी/करूंगा। इसके बाद, 15 कार्य दिवसों के
        दौरान प्रथम इसे हटा देगा या अपडेट करेगा।
      </GlobalText>
      <GlobalText
        style={[globalStyles.text, { marginTop: 10, marginBottom: 50 }]}
      >
        मैंने सभी तथ्यों को अच्छी तरह से पढ़ा और/या मुझे स्थानीय भाषा में समझाया
        गया है और मैं सभी नियमों और जानकारियों के इस्तेमाल के उद्देश्यों को पूरी
        तरह से समझती/समझता हूँ। मैंने इससे संबंधित अपनी जानकारियों के इस्तेमाल
        के बारे में बताई गई शर्तों की स्वीकृति की पुष्टि करती/करता हूँ और एकत्र
        जानकारियों के इस्तेमाल के संदर्भ में किसी भी तरह का कोई भी दावा नहीं
        करूंगी/करूंगा।"
      </GlobalText>
    </ScrollView>
  );
};

export default ConsentAbove18;
